{"Sensor Deployment Strategy for Target Detection\nThomas Clouqueur, Veradej Phipatanasuphorn, Parameswaran Ramanathan and\nKewal K. Saluja\nUniversity of Wisconsin-Madison\n1415 Engineering Drive\nMadison, WI 53706\nclouqueu@ece.wisc.edu\nABSTRACT\nIn order to monitor a region for traffic traversal, sensors\ncan be deployed to perform collaborative target detection.\nSuch a sensor network achieves a certain level of detection\nperformance with an associated cost of deployment. This\npaper addresses this problem by proposing path exposure\nas a measure of the goodness of a deployment and presents\nan approach for sequential deployment in steps. It illustrates\nthat the cost of deployment can be minimized to achieve the\ndesired detection performance by appropriately choosing the\nnumber of sensors deployed in each step.\nCategories and Subject Descriptors\nC.2.4 [Computer-Communication Networks]: Distributed\nSystems-distributed applications; C.3 [Special-purpose\nand Application-based Systems]: [signal processing \nsystems]\nGeneral Terms\nAlgorithms, Design, Performance\n1. INTRODUCTION\nRecent advances in computing hardware and software are\nresponsible for the emergence of sensor networks capable of\nobserving the environment, processing the data and making\ndecisions based on the observations. Such a network can\nbe used to monitor the environment, detect, classify and \nlocate specific events, and track targets over a specific region.\nExamples of such systems are in surveillance, monitoring of\npollution, traffic, agriculture or civil infrastructures [6]. The\ndeployment of sensor networks varies with the application\nconsidered. It can be predetermined when the environment\nis sufficiently known and under control, in which case the\nsensors can be strategically hand placed. The deployment\ncan also be a priori undetermined when the environment is\nunknown or hostile in which case the sensors may be \nairdropped from an aircraft or deployed by other means, \ngenerally resulting in a random placement.\nThis paper investigates deployment strategies for sensor\nnetworks performing target detection over a region of \ninterest. In order to detect a target moving through the region,\nsensors have to make local observations of the environment\nand collaborate to produce a global decision that reflects the\nstatus of the region covered [2]. This collaboration requires\nlocal processing of the observations, communication between\ndifferent nodes, and information fusion [7]. Since the local\nobservations made by the sensors depend on their position,\nthe performance of the detection algorithm is a function of\nthe deployment. One possible measure of the goodness of\ndeployment for target detection is called path exposure. It is\na measure of the likelihood of detecting a target traversing\nthe region using a given path. The higher the path \nexposure, the better the deployment. The set of paths to be\nconsidered may be constrained by the environment. For \nexample, if the target is expected to be following a road, only\nthe paths consisting of the roads need to be considered.\nIn this study, the deployment is assumed to be random\nwhich corresponds to many practical applications where the\nregion to be monitored is not accessible for precise \nplacement of sensors. The focus of this paper is to determine the\nnumber of sensors to be deployed to carry out target \ndetection in a region of interest. The tradeoffs lie between the\nnetwork performance, the cost of the sensors deployed, and\nthe cost of deploying the sensors. This paper is organized\nas follows. In section 2, a definition for path exposure is\nproposed and a method to evaluate the exposure of a given\npath is developed. In section 3, the problem of random \ndeployment is formulated and several solutions are presented.\nAn analytical study of these solutions is given in section 4\nand section 5 presents simulation results that are used in\nsection 6 to determine the optimum solution for a given \nenvironment. The paper concludes with section 7.\n2. PATH EXPOSURE\nIn this section, a model for sensor network target detection\nis proposed, a definition of path exposure is presented and\nexpressions for evaluating this path exposure are developed.\n2.1 Model\nConsider a rectangular sensor field with n sensors \nde42\nployed at locations si, i = 1, . . . , n. A target at location\nu emits a signal which is measured by the sensors. The \nsignal from the target decays as a polynomial of the distance.\nIf the decay coefficient is k, the signal energy of a target at\nlocation u measured by the sensor at si is given by\nSi(u) =\nK\n||u âˆ’ si||k\n(1)\nwhere K is the energy emitted by the target and ||u âˆ’ si||\nis the geometric distance between the target and the sensor.\nDepending on the environment the value k typically ranges\nfrom 2.0 to 5.0 [4].\nEnergy measurements at a sensor are usually corrupted\nby noise. If Ni denotes the noise energy at sensor i during a\nparticular measurement, then the total energy measured at\nsensor i, when the target is at location u, is\nEi(u) = Si(u) + Ni =\nK\n||u âˆ’ si||k\n+ Ni.\nThe sensors collaborate to arrive at a consensus decision as\nto whether a target is present in the region. We consider two\nbasic approaches for reaching this consensus: Value fusion\nand Decision fusion [3]. In value fusion, one of the sensors\ngathers the energy measurements from the other sensors,\ntotals up the energy and compares the sum to a threshold\nto decide whether a target is present. If the sum exceeds\nthe threshold, then the consensus decision is that a target\nis present. In contrast, in decision fusion, each individual\nsensor compares its energy measurement to a threshold to\narrive at a local decision as to whether a target is present.\nThe local decisions (1 for target present and 0 otherwise)\nfrom the sensors are totaled at a sensor and the sum is \ncompared to another threshold to arrive at the consensus \ndecision. In some situations, value fusion outperforms decision\nfusion and vice versa.\n2.1.1 Value Fusion.\nThe probability of consensus target detection when the\ntarget is at location u is\nDv(u) = Prob\nn\ni=1\nK\n||u âˆ’ si||k\n+ Ni â‰¥ Î·\n= Prob\nn\ni=1\nNi â‰¥ Î· âˆ’\nn\ni=1\nK\n||u âˆ’ si||k\n,\nwhere Î· is the value fusion threshold. If the noise processes\nat the sensors are independent, then the probability density\nfunction of n\ni=1 Ni equals the convolution of the \nprobability density function of Ni, i = 1, . . . , n. In particular, if\nthe noise process at each sensor is Additive White Gaussian\nNoise (AWGN), then n\ni=1 Ni has a Chi-square distribution\nof degree n.\nDue to the presence of noise, the sensors may incorrectly\ndecide that a target is present even though there is no \ntarget in the field. The probability of a consensus false target\ndetection is\nFv = Prob\nn\ni=1\nNi â‰¥ Î· . (2)\nAs above, if the noise processes at the sensors are \nindependent and AWGN, then the false alarm probability can be\ncomputed from the Chi-square distribution of degree n.\n2.1.2 Decision Fusion.\nFor decision fusion, the probability of consensus target\ndetection when the target is located at u is\nDd(u) = Prob\nn\ni=1\nhd,i(u) â‰¥ Î·2\n=\nn\nj=Î·2\nn\nj\nÂ· P1\nj\nÂ· P0\n(nâˆ’j)\nwhere\nP1 = Prob [hd,i(u) = 1]\n= Prob Ni â‰¥ Î·1 âˆ’\nK\n||u âˆ’ si||k\nand\nP0 = Prob [hd,i(u) = 0]\n= 1 âˆ’ Prob [hd,i(u) = 1] .\ncan be computed from Chi-square distribution of degree 1\nfor AWGN noise process.\nThe probability of false target detection at sensor i is\nProb[gd,i = 1] = Prob[Ni â‰¥ Î·1] and\nProb[gd,i = 0] = 1 âˆ’ Prob[gd,i = 1].\nTherefore, the probability of consensus false target detection\nis\nFd = Prob\nn\ni=1\ngd,i â‰¥ Î·2\n=\nn\nj=Î·2\nn\nj\nÂ· (Prob [gd,i = 1])j\nÂ· (Prob [gd,i = 0])(nâˆ’j)\nThe above equations serve as an analytic basis for \nevaluating exposure as defined in the following subsection.\nNote that in value and decision fusion the knowledge of the\nsensors location can be used to make the detection decision.\nFor example, a sensor can report values that differ \nsubstantially from its neighbors values. This discrepancy can be\nanalyzed to avoid false alarms or misses and therefore \nimprove the detection performance. However, such algorithms\nare not considered in this paper.\n2.2 DeÂ£nition of exposure\nWe define exposure to be the probability of detecting the\ntarget or an intruder carrying out the unauthorized activity,\nwhere the activity depends on the problem under \nconsideration. In this paper, the activity considered is the \nUnauthorized Traversal (UT) as defined below.\nUnauthorized Traversal (UT) Problem: We are given\na sensor field with n sensors at locations s1, s2, . . . , sn (see\nFigure 1). We are also given the stochastic characterization\nof the noise at each sensor and a tolerable bound, Î±, on the\nfalse alarm probability. Let P denote a path from the west to\nthe east periphery of the sensor field. A target traversing the\nsensor field using path P is detected if it is detected at some\npoint u âˆˆ P. The exposure of path P is the net probability\nof detecting a target that traverses the field using P. The\ntarget is assumed to be able to follow any path through the\nfield and the problem is to find the path P with the least\nexposure.\n43\nSensor\nFigure 1: Example sensor fields for UT problem.\n2.3 Solution to the UT problem\nLet P denote a path from the west to the east \nperiphery through the sensor field. A target that traverses the\nfield using P is not detected if and only if it is not detected\nat any time while it is on that path. Since detection \nattempts by the sensor network occur at a fixed frequency, we\ncan associate each detection attempt with a point u âˆˆ P\nwhen assuming that the target traverses the field at a \nconstant speed. The detection attempts are based on energy\nmeasured over a period of time T during which the target\nis moving. Therefore, the detection probability associated\nwith each point u reflects the measurements performed \nduring time T. Considering the path, the net probability of not\ndetecting a target traversing the field using P is the \nproduct of the probabilities of no detection at each point u âˆˆ P.\nThat is, if G(P) denotes the net probability of not detecting\na target as it traverses over path P, then,\nlog G(P) =\nuâˆˆP\nlog(1 âˆ’ D(u))du,\nwhere D(u) is either Dv(u) of Dd(u) depending on whether\nthe sensors use value or decision fusion to arrive at a \nconsensus decision. Since the exposure of P is (1 âˆ’ G(P)), the\nproblem is to find the path which minimizes (1 âˆ’ G(P)) or\nequivalently the path that minimizes | log G(P)|1\n.\nIn general, the path P that minimizes | log G(P)| can be\nfairly arbitrary in shape. The proposed solution does not\nexactly compute this path. Instead, we rely on the following\napproximation. We first divide the sensor field into a fine\ngrid and then assume that the target only moves along this\ngrid. The problem then is to find the path P on this grid\nthat minimizes | log G(P)|. Note that, the finer the grid the\ncloser the approximation. Also, one can use higher order\ngrids such as in [5] instead of the rectangular grid we use\nin this paper. The higher order grids change the runtime\nof the algorithm but the approach is the same as with the\nrectangular grid.\nFor the target not to be detected at any point u âˆˆ P,\n1\nNote that, G(P) lies between 0 and 1 and thus log G(P) is\nnegative.\n1. Generate a suitably fine rectangular grid.\n2. For each line segment l between adjacent grid points\n3. Compute | log ml| using Equation 3\n4. Assign l a weight equal to | log ml|\n5. Endfor\n6. Add a link from virtual point a to each grid point on\nthe west\n7. Add a link from virtual point b to each grid point on\nthe east\n8. Assign a weight of 0 to all the line segments from a\nand b\n9. Compute the least weight path P from a to b using\nDijkstra\"s algorithm\n10. Let w equal the total weight of P.\n11. Return P as the least exposure path with an\nexposure equal to 10âˆ’w\n.\nFigure 2: Pseudo-code of the proposed solution for\nthe UT problem.\nit need not be detected at any point u lying between any\ntwo adjacent grid points of P. We therefore subdivide any\npath P as a chain of grid segments. Let us consider two\nadjacent points, say v1 and v2 on the grid. Let l denote\nthe line segment between v1 and v2. Also, let ml denote\nthe probability of not detecting a target traveling between\nv1 and v2 on the line segment l. Then, from the discussion\nabove,\nlog ml =\nuâˆˆl\nlog(1 âˆ’ D(u))du (3)\nThe probability ml can be evaluated by finding the detection\nprobability D(u) at each point u âˆˆ l. Note that, ml lies\nbetween 0 and 1 and, therefore, log ml is negative.\nTo find the least exposed path, a non-negative weight\nequal to | log ml| is assigned to each segment l on this grid.\nAlso, a fictitious point a is created and a line segment is\nadded from a to each grid point on the west periphery of\nthe sensor field. A weight equal to 0 is assigned to each of\nthese line segments. Similarly, a fictitious point b is created\nand a line segment is added from b to each grid point on\nthe east periphery of the sensor field. A weight equal to 0\nis assigned to each of these line segments.\nThe problem of finding the least exposed path from west\nperiphery to east periphery is then equivalent to the problem\nof finding the least weight path from a to b on this grid. Such\na path can be efficiently determined using the Dijkstra\"s\nshortest path algorithm [1]. A pseudo-code of the overall\nalgorithm is shown in Figure 2.\nExample: Figure 3 shows a sensor field with eight sensors\nat locations marked by dark circles. Assume the noise \nprocess at each sensor is Additive White Gaussian with mean\n0 and variance 1. Further assume that the sensors use value\nfusion to arrive at a consensus decision. Then, from \nEquation 2, we chose a threshold Î· = 3.0 to achieve a false alarm\nprobability of 0.187%. The field has been divided into a\n10 Ã— 10 grid. The target emits an energy K = 12 and the\nenergy decay factor is 2. The figure shows the weight \nassigned to each line segment in the grid as described above.\nThe least exposure path found by the Dijkstra\"s algorithm\nfor this weighted grid is highlighted. The probability of \nde44\nFictitious Fictitious\nThreshold = 3.0, Detection Probability of the Path = 0.926\nPoint A Point B0.090.921.651.610.860.08\n0.860.355.1744.9\n0.03\n0.800.821.3640.5\n1.051.503.4442.580.041.41.420.17\n0.63\n3.36\n0.04\n1.48\n0.323.596.833.600.240.11\n2.01\n1.88\n0.030.030.030.050.060.070.040.020.100.03\n0.010.010.050.060.05\n0.540.45\n0.050.040.020.03\n1.14\n0.040.020.050.070.040.020.010.02\n0.010.010.010.040.31\n0.05\n0.040.010.000.01\n0.000.010.010.220.420.440.240.020.000.00\n0.010.010.010.050.480.490.060.010.010.01\n2.24\n3.00\n0.16\n0.12\n1.54\n43.4\n43.4\n2.69\n1.06\n0.98\n0.040.01\n1.18\n0.06\n0.07\n0.21\n3.45\n3.44\n0.20\n0.14\n0.74\n0.31\n0.33\n0.09\n0.05\n0.02\n0.05\n0.06\n0.06\n0.06\n0.02\n0.02\n0.01\n0.01\n0.02\n0.04\n0.03\n0.04\n0.07\n0.03\n0.05\n0.04\n0.01\n0.01\n0.01\n0.01\n0.00\n0.02\n0.06\n0.32\n0.52\n0.02\n0.03\n0.01\n0.01\n0.01\n0.00\n0.00\n0.02\n0.25\n0.49\n0.24\n0.02\n0.01\n0.01\n0.00\n0.01\n0.00\n0.01\n0.02\n0.28\n0.65\n0.25\n0.02\n0.01\n0.01\n0.00\n0.89\n1.12\n0.85\n0.24\n1.60\n40.2\n5.01\n0.29\n0.25\n1.00\n0.65\n2.29\n2.55\n0.83\n0.17\n1.89\n80.0\n44.9\n2.75\n1.05\n1.32\n0.53\n0.850.390.190.120.361.361.210.270.610.53\n0.07\n0.49\n0.19\n0.93\n1.89\n1.13\n0.16\n0.06\n0.17\n0.97\n1.26\n0.04\n1.10\n0.43\nSensor\n0.00 Edge Weight\n0.05\n1.38\nFigure 3: Illustration of the proposed solution for an example UT problem.\ntecting the target traversing the field using the highlighted\npath is 0.926.\n3. DEPLOYMENT\nIn this section, the problem of sensor deployment for \nunauthorized traversal detection is formulated and solutions are\nidentified.\n3.1 Problem formulation\nConsider a region to be monitored for unauthorized \ntraversal using a sensor network. The target to traverse the sensor\nfield emits a given energy level K and the stochastic of the\nnoise in the region is known. The sensors are to be deployed\nover the region in a random fashion where the sensors \nlocations in the region are a priori undetermined and only the\nnumber or density of sensors can be chosen. The problem is\nto find a deployment strategy that results in a desired \nperformance level in unauthorized traversal monitoring of the\nregion.\nThis performance is measured by the false alarm \nprobability and the path exposure defined in section 2. The false\nalarm probability does not depend on the sensor placement\nand is only determined by the number of sensors deployed\nand the thresholds used in the detection algorithms. It is \nassumed to be fixed in this study so that the problem consists\nof maximizing the exposure at constant false alarm rate.\nSince targets can traverse the region through any path, the\ngoal of deployment is to maximize the exposure of the least\nexposed path in the region.\nObviously, the minimum exposure in the region increases\n(if false alarm rate is kept constant) as more sensors are\ndeployed in the region. However, since the deployment is\nrandom, there are no guarantees that the desired exposure\nlevel is achieved for a given number of sensors. Indeed some\nsensor placements can result in very poor detection ability,\nin particular when the sensors are all deployed in the same\nvicinity. A study of the statistical distribution of exposure\nfor varying sensor placement for a given number of sensors\ncan provide a confidence level that the desired detection level\nis achieved. In practical situations, only a limited number\nof sensors are available for deployment and only a limited\ndetection level with associated confidence level is achievable\nat a given false alarm rate.\n3.2 Solution\nBased on the above discussion, we develop a solution method\nto the deployment problem when a maximum of M sensors\ncan be used. Deploying the M sensors results in the \nmaximum achievable detection level but is not optimal when\nconsidering the cost of sensors. To reduce the number of\nsensors deployed, only part of the available sensors can be\ndeployed first and the sensors can then report their position.\nThe random sensor placement obtained can be analyzed to\ndetermine if it satisfies the desired performance level. If it\ndoes not, additional sensors can be deployed until the \ndesired exposure level is reached or until the all M available\nsensors are deployed.\nThe number of sensors used in this strategy can be \nminimized by deploying one sensor at a time. However, a cost is\nusually associated with each deployment of sensors and \ndeploying one sensor at a time may not be cost effective if the\ncost of deployment is sufficiently large with respect to the\ncost of single sensors. By assigning a cost to both single \nsensors and deployment, the optimal number of sensors to be\ndeployed at first and thereafter can be determined. In the\nnext section, we develop analytical expressions for finding\nthe optimal solution. In general, the optimal cost solution\nis neither deploying one sensor at a time nor deploying all\nthe sensors at a time.\n4. ANALYTICAL SOLUTION\nIn this section, we derive an analytical model for the cost\nof deployment. Let ed be the desired minimum exposure for\nthe sensor network to be deployed when a maximum of M\nsensors are available for deployment. The position of sensors\nare random in the region of interest R and for a given \nnum45\n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n0\n0.05\n0.1\n0.15\n0.2\nMinimum exposure\nDensity\n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n0\n0.01\n0.02\n0.03\n0.04\nMinimum exposure\nDensity\n0 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1\n0\n0.1\n0.2\n0.3\n0.4\nMinimum exposure\nDensity\n5 sensors\n10 sensors\n15 sensors\nFigure 4: Probability density function for the \ndistribution of minimum exposure for deployments of\n5, 10 and 15 sensors.\nber of sensors n, the least exposure e is a random variable.\nLet Fn(x) denote the cumulative distribution function of e,\nthat is the probability that e is less than x, when n sensors\nare deployed.\nAs mentioned in the previous section, there is no a priori\nguarantee that the exposure ed will be obtained when \ndeploying the sensors. If M is the maximum number of sensors\navailable, the confidence of obtaining a least exposure of ed\nor more is 1âˆ’FM (ed). For the proposed solution, we assume\nthat the position of the sensors obtained after a deployment\nis known so that additional sensors can be deployed if the\nminimum exposure ed is not reached. To evaluate the \nprobability that the exposure ed is reached after additional sensor\ndeployment, we make the following approximation: the \ndistribution of exposure for n sensors is independent of the \nexposure corresponding to k of these n sensors, 1 â‰¤ k â‰¤ n âˆ’ 1.\nThis is an approximation since the exposure obtained with\nn sensors is always higher than the exposure obtained with\nonly k of these n sensors, 1 â‰¤ k â‰¤ n âˆ’ 1. We observed\nthat the re-deployment of just a few sensors can \nsubstantially modify the coverage of the region, for example when\nfilling empty spaces. The approximation is also justified by\nthe loose relation between exposure and sensors positions.\nIndeed, a given minimum exposure can correspond to many\ndifferent deployment positions, some of which can be easily\nimproved by deploying a few additional sensors (e.g. when\nthere is a empty space in the region coverage), some of which\ncan only be improved by deploying many additional sensors\n(e.g. when the sensors are evenly distributed on the region).\nAs the minimum exposure e is a random variable, the cost\nof deploying the sensors in steps until the desired exposure\nis reached is also a random variable C. We now derive the\nexpression for the expected value of C. Let ni be the total\nnumber of sensors deployed after each step i for a maximum\nnumber of steps S so that nS = M. Note that ni âˆ’ niâˆ’1\nis the number of sensors deployed at step i. Also let Cd be\nthe cost of deploying the sensors at each step and Cs be the\ncost of each sensor. If the desired exposure is obtained after\nthe first step, the cost of deployment is Cd + n1Cs, and this\n0 5 10 15 20 25 30 35 40\n0\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\n1\nNumber of sensors\nProbability\ned\n=95%\ned\n=90%\ned\n=85%\ned\n=80%\nFigure 5: Probability that the minimum \nexposure is above ed for varying number of sensors and\ned=80%,85%,90% and 95%.\nevent happens with probability 1 âˆ’ Fn1 (ed). Considering all\nthe possible events, the expected cost is given by\nE{C} =\nSâˆ’1\ni=1\n(i.Cd + ni.Cs)\niâˆ’1\nj=1\nFnj (ed) (1 âˆ’ Fni (ed))\n+ (S.Cd + M.Cs)\nSâˆ’1\nj=1\nFnj (ed) (4)\nNote that a different expression is needed for the cost of\nstep S since no additional sensors are deployed after this\nstep even when the desired exposure is not obtained.\n5. SIMULATION\nIn this section, we present results of simulations that were\nconducted to collect the exposure distribution function of\nthe number of sensors deployed.\n5.1 Method\nThe exposure distribution is obtained by collecting \nstatistics on the exposure when deploying sensors randomly in a\npredefined region. The random deployment is assumed to\nbe uniformly distributed over the region, which is a local \napproximation. For every deployment, the minimum exposure\nis found using a simulator implementing the algorithm \npresented in section 2. A decay factor of k = 2 and maximum\nenergy of K = 60 are chosen to model the energy emitted\nby targets (cf Equation 1). The region monitored is of size\n20Ã—20 with a noise (AWGN) of variance 1, so that the signal\ncoming from the target is covered by noise when the target is\n8 or more units length away from a sensor. The sensors use\nvalue fusion to collaborate when making a common decision\non the presence of a target in the region. The threshold for\ndetection is chosen as a function of the number of sensors\nto give a constant false alarm probability. The false alarm\nprobability for each detection attempt is chosen so that the\nprobability to get one or more false alarm along a path of\nlength 20 units (corresponding to 20 detection attempts by\nthe sensors) is 5%.\n46\n0 20 40\n10\n15\n20\n25\n30\n35\n40\nCost for Cd=0 and Cs=1\nn\nExpectedcost\n0 20 40\n20\n30\n40\n50\n60\n70\n80\nCost for Cd=5 and Cs=1\nn\nExpectedcost\n0 20 40\n0\n200\n400\n600\n800\n1000\n1200\n1400\nCost for Cd=100 and Cs=1\nn\nExpectedcost\nFigure 6: Expected cost of achieving minimum exposure of 95% as function of the number of sensors for\nthree different cost assignments.\n5.2 Distribution of minimum exposure\nThe distribution of minimum exposure were found for the\nnumber of sensor deployed varying from 1 to 40. To \nillustrate our results, the probability density functions for 5, 10\nand 15 sensors are shown in Figure 4.\nWe observe that for 5 sensors deployed, the minimum \nexposure has zero density for values less than the false alarm\nprobability of .04. The highest density is obtained for \nvalues around .07 and then drops exponentially towards zero\nfor higher values of exposure. For deployment of 10 sensors,\nwe find again that the minimum exposure has zero density\nfor values below .04, then increases and has about constant\ndensity for values lying between .1 and .98. We also observe\na peak of density around 1. For deployment of 15 sensors,\ndensities start at zero for small values and remain very small\nfor most values of minimum exposure. The density slowly\nincreases and has a large peak for minimum exposure of 1.\nAs expected, the minimum exposure increases on average\nas the number of sensors deployed increases. When \nrandomly deploying 5 sensors, it is very unlikely to obtain a\nplacement providing a desirable minimum exposure. When\ndeploying 10 sensors, most of the exposure levels are equally\nlikely and only poor confidence is given to obtain a \ndesirable exposure level. When deploying 15 sensors, it is very\nlikely that the sensor placement will give good exposure and\nthis likelihood keeps increasing with the number of sensors\ndeployed.\nWe use the cumulative distribution function obtained from\nthe statistics collected to evaluate the likelihood that the \ndesired level of exposure ed is obtained for varying number of\nsensors. The graph of Figure 5 shows the probability that\nthe minimum exposure is above ed as a function of the \nnumber of sensors deployed for ed = 80%, 85%, 90% and 95%.\nThese values can be used to evaluate the cost expressed in\nEquation 4. The graph shows that the confidence level to\nobtain a given minimum exposure level ed increases with the\nnumber of sensors deployed. The confidence for ed when \ndeploying 40 sensors is above .999, which is sufficient for most\napplications, and therefore we did not evaluate the \ndistribution of exposure when deploying more than 40 sensors.\n6. RESULTS\nIn this section, we evaluate the expected cost of deploying\nsensors using the simulation results. The optimal number\nof sensor to deploy at first and in the succeeding steps can\nbe derived from these results.\nFor this cost analysis, the region parameters and signal\nmodel are the same as specified in section 5. We further\nassume that the number of sensors deployed at every step\nis constant so that ni âˆ’ niâˆ’1 = n for all 1 â‰¤ i â‰¤ S. In this\ncase, Equation 4 reduces to\nE{C} = (Cd + n.Cs)\nSâˆ’1\ni=1\ni.\niâˆ’1\nj=1\nFj.n(ed) (1 âˆ’ Fi.n(ed))\n+ (S.Cd + M.Cs)\nSâˆ’1\nj=1\nFj.n(ed) (5)\nWe evaluated the expected cost as a function of n for\nthree different cost assignments with a desired exposure of\ned = 95%. The three corresponding graphs are shown in\nFigure 6. The first cost assignment is (Cd = 0, Cs = 1) so\nthat the expected cost is the expected number of sensors to\nbe used to achieve an exposure of 95%. Since Cd = 0, the\nnumber of steps used to deploy the sensors doesn\"t affect the\ncost and it is therefore optimal to deploy one sensor at a time\nuntil the minimum exposure ed is reached, as we observe on\nthe graph. Overall, the expected number of sensor to be\n47\ndeployed increases with n but we observe a local minimum\nfor n = 16 that can be explained by the following analysis.\nThe expected number of sensors is a weighted sum of i.n, 1 â‰¤\ni â‰¤ S that are the different number of sensors than can\nbe deployed at a time when deploying n sensors at each\nstep. For n around 16, the probability that the minimum\nexposure is above ed varies a lot as shown in Figure 5 and the\nweight associated with the first term of the sum (n) increases\nrapidly while the weights associated with higher number of\nsensors decrease. This is the cause of the local minimum\nand the cost starts to increase again when the increase in n\ncompensates for the decrease in weights.\nThe second cost assignment is (Cd = 5, Cs = 1) so that\nthe cost of a deployment is equal to the cost of five sensors\n(note that only the relative cost of Cd/Cs determines the\nshape of the graphs). In this case, deploying one sensor at a\ntime is prohibited by the cost of deployment and the optimal\nnumber of sensors to deploy at every step is 19. Again, we\nfind that the curve presents a local minimum for n = 9 that\nis due to the variations in weights. The last cost assignment\nis (Cd = 100, Cs = 1) and the minimum cost is achieved\nwhen deploying 27 sensors at every step.\nThese results are specific to the region and the parameters\ncharacterizing the signal emitted by the target that were\nchosen for the simulation. Similar results can be derived for\nother parameters, most of the effort residing in finding the\nexposure distributions through simulation.\n7. CONCLUSION\nThis paper addresses the problem of sensor deployment\nin a region to be monitored for target intrusion. A \nmechanism for sensor collaboration to perform target detection\nis proposed and analyzed to evaluate the exposure of paths\nthrough the region. The minimum exposure is used as a\nmeasure of the goodness of deployment, the goal being to\nmaximize the exposure of the least exposed path in the \nregion.\nIn the case where sensors are randomly placed in a region\nto be monitored, a mechanism for sequential deployment in\nsteps is developed. The strategy consists of deploying a \nlimited number of sensors at a time until the desired minimum\nexposure is achieved. The cost function used in this study\ndepends on the number of sensors deployed in each step and\nthe cost of each deployment. Through simulation, the \ndistribution of minimum exposure obtained by random \ndeployment was evaluated for varying number of sensors deployed.\nThese results were used to evaluate the cost of deployment\nfor varying number of sensors deployed in each step.\nWe found that the optimal number of sensors deployed in\neach step varies with the relative cost assigned to \ndeployment and sensors. The results of this study can be extended\nto larger regions with different target parameters. The \nsolution proposed in this paper can also be improved by \nconsidering deploying variable number of sensors at each step\nand this multiple variables problem requires further \ninvestigation.\n8. ACKNOWLEDGMENTS\nThis work was supported in part by the Defense Advanced\nResearch Projects Agency (DARPA) and the Air Force \nresearch Laboratory, Air Force Material Command, USAF,\nunder agreement number F30602-00-2-055. The U.S. \nGovernment is authorized to reproduce and distribute reprints\nfor Governmental purposes notwithstanding any copyright\nannotation thereon.\n9. REFERENCES\n[1] S. Baase and A. V. Gelder. Computer algorithms:\nIntroduction to design and analysis. Addison-Wesley,\n2000.\n[2] R. R. Brooks and S. S. Iyengar. Multi-Sensor Fusion:\nFundamentals and Applications with Software. Prentice\nHall, 1998.\n[3] T. Clouqueur, P. Ramanathan, K. K. Saluja, and K.-C.\nWang. Value-fusion versus decision-fusion for\nfault-tolerance in collaborative target detection in\nsensor networks. In Proceedings of Fourth International\nConference on Information Fusion, Aug. 2001.\n[4] M. Hata. Empirical formula for propagation loss in\nland mobile radio services. IEEE Transactions on\nVehicular Technology, 29:317-325, Aug. 1980.\n[5] S. Meguerdichian, F. Koushanfar, G. Qu, and\nM. Potkonjak. Exposure in wireless ad-hoc sensor\nnetworks. In Proceedings of MOBICOM, pages 139-150,\nJuly 2001.\n[6] Sensor Information Technology Website,.\nhttp://www.darpa.mil/ito/research/sensit/index.html.\n[7] P. Varshney. Distributed Detection and Data Fusion.\nSpringer-Verlag New-York, 1996.\n48\n": ["target detection", "sensor network", "path exposure", "number of sensor", "sensor number", "sequential deployment", "minimum exposure", "random sensor placement", "sensor field", "target decay", "collaborative target detection", "deployment", "exposure", "value fusion", ""]}